Revit 2027 API
ElectricalSystem.OtherConductorsNumber Property
 The OtherConductors Number of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int OtherConductorsNumber { get; }
Public ReadOnly Property OtherConductorsNumber As Integer
	Get
public:
property int OtherConductorsNumber {
	int get ();
}
member OtherConductorsNumber : int with get
Property Value
Int32
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the OtherConductors Number of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace